archive/before-2018-11-10/2017-09-21-结合ivy使用书签.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2017-09-21-结合ivy使用书签</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2017-09-21-结合ivy使用书签</h1>
<p>
使用浏览器书签时，有时候太多了，找起来很麻烦。最近我开始使用emacs-w3m
来存书签。默认保存到 <code>~/.w3m/bookmark.html</code> 文件中。
</p>

<p>
然后我尝试了 <a href="https://github.com/emacs-helm/helm/blob/master/helm-bookmark.el">helm-bookmarks</a> ，它可以使用helm来帮助选择书签。
</p>

<p>
但我是 <code>ivy</code> 用户，平时少有使用helm。还有一个问题是我的书签中有很多中
文标题，如果需要选择中文标题的书签时，还需要切换输入法。
</p>

<p>
针对中文标题这个问题，由于之前我 <a href="https://github.com/pengpengxp/swiper/wiki/ivy-support-chinese-pinyin">hack</a> 过一下ivy，使它可以支持拼音首字
母搜索，可以参考一下 <a href="https://raw.githubusercontent.com/pengpengxp/.emacs.d/ubuntu16.04/lisp/init-ivy.el">我的配置</a> 。所以我只需要使用ivy帮助我选择书签就可
以了。
</p>

<p>
首先需要解析我的书签文件，使用 <code>libxml-parse-html-region</code> 可以解析文件，
返回一个 <code>DOM object</code> 。还需要 <a href="https://github.com/pengpengxp/.emacs.d/blob/ubuntu16.04/site-lisp/dom.el">dom.el</a> 来解析 <code>DOM object</code> 。不过据说
<code>Emacs 25</code> 已经内置了 <code>dom.el</code> 了。如果使用 <code>Emacs 24</code> 的同学可能需要
自行下载一下。
</p>

<p>
思路很简单，把所有的 <code>a</code> 标签全部解析出来，做出来一个 <code>((name1 url1)
(name2 url2) ...)</code> 这样格式的列表。使用 <code>ivy-read</code> 来选择一个 <code>name</code>
，最后根据 <code>name</code> 找到对应的 <code>url</code> 。
</p>

<p>
代码如下：
</p>
<div class="org-src-container">
<pre class="src src-elisp">  <span style="color: #6c6c6c; font-style: italic;">;;; </span><span style="color: #6c6c6c; font-style: italic;">use `</span><span style="color: #5fafd7; font-style: italic;">ivy</span><span style="color: #6c6c6c; font-style: italic;">' to use w3m-bookmarks</span>
  (<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">dom</span>)
  <span style="color: #6c6c6c; font-style: italic;">;;; </span><span style="color: #6c6c6c; font-style: italic;">where your bookmark file located</span>
  (<span style="color: #a1db00;">setq</span> peng-bookmark-file <span style="color: #ff4ea3;">"~/.w3m/bookmark.html"</span>)

  (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">peng-ivy-get-bookmarks</span> ()
    <span style="color: #ff4b4b;">"use `</span><span style="color: #5fafd7;">ivy-read</span><span style="color: #ff4b4b;">' to select bookmark and return its url</span>
<span style="color: #ff4b4b;">  "</span>
    (<span style="color: #a1db00;">let*</span> ((dom (<span style="color: #a1db00;">with-temp-buffer</span>
                  (insert-file-contents peng-bookmark-file)
                  (libxml-parse-html-region (point-min)
                                            (point-max))))
           (a (dom-by-tag dom 'a))
           (mylist (mapcar 'peng-parse-dom-tag-to-personal-format a))
           (name (ivy-read <span style="color: #ff4ea3;">"Jump to bookmarks:"</span> (mapcar 'car mylist)))
           <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">todo: I need to find `</span><span style="color: #5fafd7; font-style: italic;">name</span><span style="color: #6c6c6c; font-style: italic;">' in mylist, if find, break the</span>
           <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">loop. But now, I just use `</span><span style="color: #5fafd7; font-style: italic;">mapcar</span><span style="color: #6c6c6c; font-style: italic;">' to deal with every</span>
           <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">element in mylist and get `</span><span style="color: #5fafd7; font-style: italic;">final-result</span><span style="color: #6c6c6c; font-style: italic;">' by removing all</span>
           <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">nil element in the list `</span><span style="color: #5fafd7; font-style: italic;">result</span><span style="color: #6c6c6c; font-style: italic;">'. It's very ugly code!</span>
           (result (mapcar #'(lambda (data)
                               (<span style="color: #a1db00;">if</span> (string= (car data)
                                            name)
                                   (cdr data)
                                 nil))
                           mylist))
           (final-result (caar (remove nil result))))
      final-result))

  (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">peng-parse-dom-tag-to-personal-format</span> (dom)
    <span style="color: #ff4b4b;">"parse a tag to `(name url) format'"</span>
    (<span style="color: #a1db00;">let</span> ((url (<span style="color: #a1db00;">dom-attr</span> dom 'href))
          (name (dom-text dom)))
      (list name url)))
</pre>
</div>

<p>
最后，写几个 <code>interactive</code> 的函数来选择用不同的浏览器打开：
</p>
<div class="org-src-container">
<pre class="src src-elisp">  (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">peng-bookmarks-firefox</span> ()
    (<span style="color: #a1db00;">interactive</span>)
    (<span style="color: #a1db00;">let</span> ((url (peng-ivy-get-bookmarks)))
      (browse-url-firefox url)))

  (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">peng-bookmarks-chrome</span> ()
    (<span style="color: #a1db00;">interactive</span>)
    (<span style="color: #a1db00;">let</span> ((url (peng-ivy-get-bookmarks)))
      (browse-url-chromium url)))

  (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">peng-bookmarks-w3m</span> ()
    (<span style="color: #a1db00;">interactive</span>)
    (<span style="color: #a1db00;">let</span> ((url (peng-ivy-get-bookmarks)))
      (w3m-goto-url-new-session url)))
</pre>
</div>

<p>
在函数 <code>peng-ivy-get-bookmarks</code> 中，得到标题名 <code>title</code> 后，从 <code>((name1
url1) (name2 url2) ...)</code> 列表中找对应的url时，我写得很丑：用map返回一
个 <code>(nil nil (URL) nil ...)</code> 这样的列表，然后又用 <code>remove</code> 把所有的
<code>nil</code> 去掉。最后剩下的就是需要的 <code>url</code> 。其实应该是循环 <code>mylist</code> ，找
到对应的 <code>name</code> 后就退出的。但我不知道怎么写。至少现在是可以工作了。
</p>

<p>
最后，我尝试了把我 <code>firefox</code> 的书签导出到html中，使用上面的函数也可以
工作。只需要把 <code>peng-bookmark-file</code> 改成对应的html文件就好。
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>